web/app/controllers/bloggs_controller.rb

SELECT "bloggs".* FROM "bloggs"
---
  def index
    @articles = Blogg.all

SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Blogg.find(params[:id])

SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    puts 'EDITING'
    puts params
    @article = Blogg.find(params[:id])

INSERT INTO "bloggs" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testing"], ["text", "123\r\n"], ["created_at", "2015-01-23 15:01:51.102397"], ["updated_at", "2015-01-23 15:01:51.102397"]]
---
  def create
    @article = Blogg.new(article_params)

    if @article.save

SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "abc"], ["updated_at", "2015-01-23 22:03:23.222109"], ["id", 1]]
UPDATE "bloggs" SET "title" = ?, "updated_at" = ? WHERE "bloggs"."id" = ?  [["title", "testingfdsf"], ["updated_at", "2015-01-30 21:49:30.119870"], ["id", 1]]
---
  def update
    @article = Blogg.find(params[:id])
    puts 'LOOK AT ME!!!'
    puts article_params
    if @article.update(article_params)

SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bloggs" WHERE "bloggs"."id" = ?  [["id", 1]]
---
  def destroy
    @tempBlog = Blogg.find(params[:id])
    @tempBlog.destroy