web/app/controllers/comments_controller.rb

  def create
    @article = Blogg.find(params[:blogg_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "blogg_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "matt"], ["body", "please"], ["blogg_id", 3], ["created_at", "2015-02-26 22:47:17.529764"], ["updated_at", "2015-02-26 22:47:17.529764"]]

  def destroy
    @article = Blogg.find(params[:blogg_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT  "bloggs".* FROM "bloggs" WHERE "bloggs"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blogg_id" = ? AND "comments"."id" = ? LIMIT 1  [["blogg_id", 3], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]