web/app/views/bloggs/show.html.erb

<h2>Comments</h2>
<% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blogg_id" = ?  [["blogg_id", 3]]